////// IDD_STL_USPG_PMODE_DLG
IDC_GUSPG_FRM_MATL_BEAM                       = "Material"
IDC_GUSPG_LBL_MATL_BEAM                       = "Purlin / Girth"
IDC_GUSPG_FRM_MEMB_TYPE                       = "Member Type"
IDC_GUSPG_RDO_MEMB_TYPE_PURL                  = "Purlin (Roof)"
IDC_GUSPG_RDO_MEMB_TYPE_GIRT                  = "Girth (Wall)"
IDC_GUSWO_FRM_SECT                            = "Section"
IDC_GUSPG_FRM_SPAN                            = "Span"
IDC_GUSPG_LBL_SPAN_L                          = "Span"
IDC_GUSPG_LBL_SPAN_S                          = "Space"
IDC_GUSPG_RDO_SPAN_1                          = "1 Span"
IDC_GUSPG_RDO_SPAN_2                          = "2 Span"
IDC_GUSPG_RDO_SPAN_3                          = "3 Span"
IDC_GUSPG_FRM_LENG                            = "Length"
IDC_GUSPG_LBL_LENG_P                          = "Length (+)"
IDC_GUSPG_LBL_LENG_N                          = "Length (-)"
IDC_GUSPG_FRM_LOAD                            = "Design Load"
IDC_GUSPG_CHK_LOAD_USER                       = "Enter Design Load Directly"
IDC_GUSPG_LBL_LOAD_LIVE                       = "Live Load"
IDC_GUSPG_LBL_LOAD_ROOF                       = "Dead Load"
IDC_GUSPG_LBL_LOAD_WIND                       = "Wind Load"
IDC_GUSPG_CHK_AUTO_WIND                       = "Auto"
IDC_GUSPG_LBL_LOAD_SNOW                       = "Snow Load"
IDC_GUSPG_CHK_AUTO_SNOW                       = "Auto"
IDC_GUSPG_FRM_DEFL                            = "Deflection"
IDC_GUSPG_LBL_DEFL_DEFL                       = "Deflection"
IDC_GUSPG_FRM_PROP                            = "Section Property"
IDC_GUSPG_FRM_RESULT                          = "Calculation Result"
IDC_GUSPG_LBL_LOAD_USER_MP                    = "Moment (+)"
IDC_GUSPG_LBL_LOAD_USER_MN                    = "Moment (-)"
IDC_GUSPG_LBL_LOAD_USER_VP                    = "Shear (+)"
IDC_GUSPG_LBL_LOAD_USER_VN                    = "Shear (-)"
IDC_GUSPG_LBL_LOAD_WALL                       = "Dead Load"

////// IDD_STL_USPG_LOAD_DLG
IDC_GUSPG_RDO_VIEW_SECT                       = "Section"
IDC_GUSPG_RDO_VIEW_CHCK                       = "Checking Point"

/////// IDD_STL_WEBOPEN_MLIST_FORCE_DLG
IDD_STL_WEBOPEN_MLIST_FORCE_DLG               = "Concentrated Force"
IDC_STL_LIST_FORCE_SELECT_FRM_MEMB            = "Select Member"
IDC_STL_LIST_FORCE_SELECT_BTN_ALL             = "All"
IDC_STL_LIST_FORCE_SELECT_BTN_NON             = "None"
IDC_STL_LIST_FORCE_FRM_CONCEN_FORCE           = "Concentrated Force"
IDC_STL_LIST_FORCE_CHK_CONC                   = "Consider Concentrated Force"
IDC_STL_LIST_FORCE_BTN_APPLY                  = "Apply"
IDC_STL_LIST_FORCE_BTN_CANCEL                 = "Cancel"

////// IDD_STL_BEAMCOL_SMODE_INPUT_SECT1_DLG
IDC_STL_FRAME_MATERIAL                        = "Material"
IDC_STL_LABEL_MATERIAL                        = "Material"
IDC_STL_FRAME_MEMBER                          = "Member Type"
IDC_STL_RADIO_MEMBER_BEAM                     = "Beam"
IDC_STL_RADIO_MEMBER_COLUMN                   = "Column"
IDC_STL_FRAME_SECTION                         = "Section"

////// IDD_STL_BEAMCOL_SMODE_INPUT_SECT2_DLG
IDC_STL_FRAME_FORCE                           = "Force && Factor"
IDC_STL_LABEL_FORCE_AXIAL                     = "Axial"
IDC_STL_LABEL_FORCE_MX                        = "Moment (x)"
IDC_STL_LABEL_FORCE_MY                        = "Moment (y)"
IDC_STL_LABEL_FORCE_VX                        = "Shear (x)"
IDC_STL_LABEL_FORCE_VY                        = "Shear (y)"
IDC_STL_LABEL_FORCE_TORSION                   = "Torsion"
IDC_STL_CHK_FORCE_TORSION                     = "Check Torsion"
IDC_STL_BTN_TORSION_DATA                      = "Torsion Design Data ..."
IDC_STL_LABEL_FACTOR_CB                       = "Cb"
IDC_STL_INPUT_BTN_LCOMB                       = "Load Combinations ..."
IDC_STL_FRAME_LENGTH                          = "Length"
IDC_STL_LABEL_LENGTH_LX                       = "Lx"
IDC_STL_LABEL_LENGTH_LY                       = "Ly"
IDC_STL_LABEL_LENGTH_LB                       = "Lb"
IDC_STL_LABEL_LENGTH_KX                       = "Kx"
IDC_STL_LABEL_LENGTH_KY                       = "Ky"
IDC_STL_FRAME_SEISMIC                         = "Seismic Design"
IDC_STL_CHK_SEISMIC                           = "Apply seismic width-thickness ratio"
IDC_STL_CHK_LINK                              = "Check as linked beam"
IDC_STL_LABEL_SYSTEM_TYPE                     = "Lateral Force Resisting System"
IDC_STL_FRAME_CONCEN                          = "Flg && Webs under Concentrated Forces"
IDC_STL_CHK_CONCEN                            = "Check Flanges && Webs"
IDC_STL_INPUT_BTN_CONCEN                      = "Stiffener && Force Data ..."
IDC_STL_COMB_RATIO_TYPE_PIPE_SECTION          = "Combined Ratio ( Pipe Section )"

////// IDD_STL_BEAMCOLUMN_INPUT_DLG
IDC_STL_FRAME_PROPERTY                        = "Section Property"
IDC_STL_FRAME_RESULT                          = "Calculation Result"

/////// IDD_STL_WEBOPEN_FORCE_DLG
IDC_STL_WEBOPEN_FORCE_BTN_ADD                 = "Add"
IDC_STL_WEBOPEN_FORCE_BTN_DEL                 = "Delete"
IDC_STL_WEBOPEN_FORCE_BTN_IST                 = "Insert"

/////// IDD_STL_WEBOPEN_PMODE_DLG
IDC_GUSWO_FRM_MATL                            = "Material"
IDC_GUSWO_LBL_MATL_BEAM                       = "Beam"
IDC_GUSWO_LBL_MATL_PLAT                       = "Plate"
IDC_GUSWO_LBL_MATL_STUD                       = "Stud"
IDC_GUSWO_LBL_MATL_CONC                       = "Concrete"
IDC_GUSWO_FRM_SECT_TYPE                       = "Section Type"
IDC_GUSWO_RDO_SECT_TYPE_COM                   = "Composite Beam"
IDC_GUSWO_RDO_SECT_TYPE_STL                   = "Steel Beam"
IDC_GUSWO_FRM_SECT_BEAM                       = "Section ( Beam )"
IDC_GUSWO_FRM_SECT_DECK                       = "Section ( Deck Plate )"
IDC_GUSWO_FRM_SPAN                            = "Span"
IDC_GUSWO_LBL_SPAN_L                          = "Span"
IDC_GUSWO_LBL_SPAN_S                          = "Spacing"
IDC_GUSWO_FRM_OPEN                            = "Opening"
IDC_GUSWO_RDO_OPEN_RECT                       = "Rectangle"
IDC_GUSWO_RDO_OPEN_CIRC                       = "Circle"
IDC_GUSWO_LBL_OPEN_POS                        = "Position"
IDC_GUSWO_LBL_OPEN_ECC                        = "Eccentricity"
IDC_GUSWO_LBL_OPEN_SIZ1                       = "Size(B)"
IDC_GUSWO_LBL_OPEN_SIZ2                       = "Size(H)"
IDC_GUSWO_LBL_OPEN_SIZ2_DIA                   = "Diameter(D)"
IDC_GUSWO_LBL_OPEN_SIZ3                       = "Corner"
IDC_GUSWO_FRM_SECT_SLAB                       = "Section ( Slab )"
IDC_GUSWO_RDO_SECT_SLAB_FULL                  = "T-Shape"
IDC_GUSWO_RDO_SECT_SLAB_HALF                  = "Half T-Shape"
IDC_GUSWO_LBL_SECT_SLAB_T                     = "Thickness"
IDC_GUSWO_FRM_SECT_PLAT                       = "Section ( Plate )"
IDC_GUSWO_CHK_SECT_PLAT_USE                   = "Reinforce Opening"
IDC_GUSWO_CHK_SECT_PLAT_DBL                   = "Use Double Plate"
IDC_GUSWO_LBL_SECT_PLAT_T                     = "Thickness"
IDC_GUSWO_LBL_SECT_PLAT_B                     = "Width"
IDC_GUSWO_FRM_SECT_STUD                       = "Section ( Stud Bolt )"
IDC_GUSWO_LBL_SECT_STUD_TYP                   = "Type"
IDC_GUSWO_LBL_SECT_STUD_COL                   = "Columns"
IDC_GUSWO_LBL_SECT_STUD_SPA                   = "Space"
IDC_GUSWO_LBL_SECT_STUD_LEN                   = "Length"
IDC_GUSWO_FRM_LOAD                            = "Design Load"
IDC_GUSWO_LBL_LOAD_CALC_UNIT                  = "Unit Load"
IDC_GUSWO_CHK_LOAD_CALC_SELF                  = "Consider Self Weight"
IDC_GUSWO_CHK_LOAD_CALC_CONC                  = "Consider Concentrated Load"
IDC_GUSWO_LBL_LOAD_USER_M                     = "Moment"
IDC_GUSWO_LBL_LOAD_USER_V                     = "Shear"
IDC_GUSWO_FRM_RESULT                          = "Calculation Result"
IDC_GUSWO_CHK_LOAD_USER                       = "Enter Design Load Directly"

/////// IDD_STL_WEBOPEN_OPEN_DLG
IDC_GUSWO_RDO_DRAW_SECT                       = "Section"
IDC_GUSWO_RDO_DRAW_ELEV                       = "Elevation"

// SteelBoltConnectionInputDlg
IDC_GUSBC_RADIO_BEAM_SPLICE                   = "Girder Splice"
IDC_GUSBC_RADIO_COLUMN_SPLICE                 = "Column Splice"
IDC_GUSBC_RADIO_SHEAR_CONNECTION              = "Shear Connection"
IDC_GUSBC_RADIO_SHEAR_SINGLE                  = "Single Shear"
IDC_GUSBC_RADIO_SHEAR_DOUBLE                  = "Double Shear"
IDC_GUSBC_CHK_ECCENTRIC                       = "Consider Eccentricity"
IDC_GUSBC_CHK_AUTO_BOLT_SPACE                 = "Auto"
IDC_GUSBC_CHK_AUTO_BOLT_EXTENSION             = "Auto"
IDC_GUSBC_CHK_AUTO_BOLT_GAP                   = "Auto"
IDC_GUSBC_CHK_BYCODE_BOLT_SPACE               = "By Code"
IDC_GUSBC_CHK_BYCODE_BOLT_EXTENSION           = "By Code"
IDC_GUSBC_CHK_BYCODE_BOLT_GAP                 = "By Code"
IDC_GUSBC_CHK_BOLT_HOLE_DEFORM                = "Consider Bolt Hole Deformation"
IDC_GUSBC_RADIO_RESULT_WEB                    = "Web"
IDC_GUSBC_RADIO_RESULT_FLG                    = "Flange"
IDC_GUSBC_FRAME_SECTION                       = "Beam/Column"
IDC_GUSBC_FRAME_MATERIAL                      = "Material"
IDC_GUSBC_LABEL_MATERIAL_BEAMCOLUMN           = "Beam/Column"
IDC_GUSBC_LABEL_MATERIAL_PLATE                = "Plate"
IDC_GUSBC_FRAME_FORCE                         = "Force"
IDC_GUSBC_LABEL_FORCE_AXIAL                   = "Axial"
IDC_GUSBC_LABEL_FORCE_MX                      = "Moment (x)"
IDC_GUSBC_LABEL_FORCE_MY                      = "Moment (y)"
IDC_GUSBC_LABEL_FORCE_VX                      = "Shear (x)"
IDC_GUSBC_LABEL_FORCE_VY                      = "Shear (y)"
IDC_GUSBC_STRING_FORCE                        = "% Strength Design"
IDC_GUSBC_STATIC_PICTURE                      = "Drawing"
IDC_GUSBC_FRAME_BOLT                          = "Bolt"
IDC_GUSBC_RADIO_BOLT_SLIP                     = "Slip-critical"
IDC_GUSBC_RADIO_BOLT_BEARING                  = "Bearing"
IDC_GUSBC_LABEL_BOLT_MATERIAL                 = "Material"
IDC_GUSBC_LABEL_BOLT_TYPE                     = "Type"
IDC_GUSBC_LABEL_BOLT_HOLE                     = "Hole Type"
IDC_GUSBC_LABEL_BOLT_SPACE_X                  = "Spacing (x)"
IDC_GUSBC_LABEL_BOLT_SPACE_Y                  = "Spacing (y)"
IDC_GUSBC_LABEL_BOLT_SPACE                    = "Spacing"
IDC_GUSBC_LABEL_BOLT_EXTENSION_X              = "Extension (x)"
IDC_GUSBC_LABEL_BOLT_EXTENSION_Y              = "Extension (y)"
IDC_GUSBC_LABEL_BOLT_EXTENSION                = "Extension"
IDC_GUSBC_RADIO_BOLT_WEB                      = "Web"
IDC_GUSBC_RADIO_BOLT_FLANGE                   = "Flange"
IDC_GUSBC_CHK_MAX_VALUE                       = "Check Max Value"
IDC_GUSBC_LABEL_BOLT_Gap                      = "Gap"
IDC_GUSBC_FRAME_FACTOR                        = "Factor"
IDC_GUSBC_LABEL_FACTOR_MOMENT                 = "Moment Distribution Factor"
IDC_GUSBC_FRAME_RESULT                        = "Calculation Result"
IDC_GUSBC_FRAME_BOLT_WEB                      = "Web"
IDC_GUSBC_LABEL_BOLT_WEB_NO                   = "No. per Side"
IDC_GUSBC_STRING_BOLT_WEB_NO                  = "EA"
IDC_GUSBC_LABEL_BOLT_WEB_THICK                = "Thickness"
IDC_GUSBC_FRAME_BOLT_FLANGE                   = "Flange"
IDC_GUSBC_LABEL_BOLT_FLANGE_NO                = "No. per Side"
IDC_GUSBC_STRING_BOLT_FLANGE_NO               = "EA"
IDC_GUSBC_LABEL_BOLT_FLANGE_THICK_EXT         = "Thk. (Ext.)"
IDC_GUSBC_LABEL_BOLT_FLANGE_THICK_INT         = "Thk. (Int.)"
IDC_GUSBC_FRAME_TYPE                          = "Connection Type"
IDC_GUSBC_FRAME_SHEAR_TYPE                    = "Shear Type"
IDC_GUSBC_LABEL_BOLT_SLIP                     = "Slip Factor"

IDS_USBC_TOOLTIP_MEMBER_LENGTH_DIRECTION      = "Longitudinal Direction of Member"
IDS_USBC_TOOLTIP_SECTION_DIRECTION            = "Transversal Direction of Member"
IDS_STL_BOLT_HOLE_PARALLEL_TO_MEMBER_DIR      = "Check if Bolt Hole is Parallel to the Longitudinal Direction of the Member."

//SteelBoltConnSimpleInputSect2Dlg
IDC_GUSBC_RADIO_VIEW_TOTL                     = "Total"
IDC_GUSBC_RADIO_VIEW_PLAN                     = "Plan"
IDC_GUSBC_RADIO_VIEW_PLAN_ELEV_SECT           = "Plan + Elevation + Section"
IDC_GUSBC_RADIO_VIEW_ELEV                     = "Elevation"
IDC_GUSBC_RADIO_VIEW_SECT                     = "Section"

///// IDD_STL_USBP_PMODE_DLG
IDC_GUSBP_INPUT_BTN_LCOMB                     = "Load Combinations ..."
IDC_GUSBP_CHK_BASEPLATE_LOCATION              = "Placed on Pedestal"
IDC_GUSBP_CHECK_PREVIEW_MESHLINE              = "Mesh Line"
IDC_GUSBP_CHECK_PREVIEW_CONTOUR               = "Contour"
IDC_GUSBP_CHECK_PREVIEW_VALUE                 = "Value"
IDC_GUSBP_CHK_WINGPLATE                       = "Use Wing Plate"
IDC_GUSBP_CHK_WINGHOR                         = "Horizontal"
IDC_GUSBP_CHK_WINGVER                         = "Vertical"
IDC_GUSBP_FRAME_WINGPLATE                     = "Wing Plate"
IDC_GUSBP_FRAME_RIBPLATE                      = "Rib Plate"
IDC_GUSBP_CHK_RIBPLATE                        = "Use Rib Plate"
IDC_GUSBP_CHK_RIB_EXTEND                      = "Extend to base plate edge"
IDC_GUSBP_CHK_BOLT_FROM_RIB                   = "Get number from Rib-Plate Layout"
IDC_GUSBP_INPUT_BTN_ANCHOR                    = "Post-Installed Anchor Bolt Design Data ..."
IDC_GUSBP_INPUT_BTN_ANCHOR_ABB                = "Post Anchor Design Data ..."
IDC_GUSBP_FRAME_SECTION                       = "Section"
IDC_GUSBP_FRAME_MATERIAL                      = "Material"
IDC_GUSBP_LABEL_MATERIAL_PLATE                = "Base Plate"
IDC_GUSBP_LABEL_MATERIAL_RIBPL                = "Rib / Wing"
IDC_GUSBP_LABEL_MATERIAL_ANCHOR               = "Anchor Bolt"
IDC_GUSBP_LABEL_MATERIAL_CONCRETE             = "Concrete"
IDC_GUSBP_FRAME_FORCE                         = "Force"
IDC_GUSBP_LABEL_FORCE_AXIAL                   = "Axial"
IDC_GUSBP_LABEL_FORCE_MX                      = "Moment (x)"
IDC_GUSBP_LABEL_FORCE_MY                      = "Moment (y)"
IDC_GUSBP_LABEL_FORCE_VX                      = "Shear (x)"
IDC_GUSBP_LABEL_FORCE_VY                      = "Shear (y)"
IDC_GUSBP_CHK_SOLVE_ALL                       = "Run FES for All Load Combination"
IDC_GUSBP_FRAME_BASEPLATE                     = "Base Plate"
IDC_GUSBP_LABEL_BASEPLATE_WIDTH               = "Width"
IDC_GUSBP_LABEL_BASEPLATE_HEIGHT              = "Height"
IDC_GUSBP_LABEL_BASEPLATE_THICK               = "Thickness"
IDC_GUSBP_FRAME_PEDESTAL                      = "Pedestal"
IDC_GUSBP_LABEL_PEDESTAL_WIDTH                = "Width"
IDC_GUSBP_LABEL_PEDESTAL_HEIGHT               = "Height"
IDC_GUSBP_STATIC_PICTURE                      = "Drawing"
IDC_GUSBP_FRAME_RESULT                        = "Calculation Result"
IDC_GUSBP_LABEL_RIBPLATE_HEIGHT               = "Height"
IDC_GUSBP_LABEL_RIBPLATE_LENGTH               = "Length"
IDC_GUSBP_LABEL_RIBPLATE_THICK                = "Thickness"
IDC_GUSBP_LABEL_RIBPLATE_NO                   = "Number"
IDC_GUSBP_LABEL_RIBPLATE_NO_X                 = "Number (x)"
IDC_GUSBP_LABEL_RIBPLATE_NO_Y                 = "Number (y)"
IDC_GUSBP_LABEL_RIBPLATE_NO_XY                = "Number ( x | y )"
IDC_GUSBP_LABEL_WINGPLATE_THICK               = "Thickness"
IDC_GUSBP_LABEL_WINGPLATE_HEIGHT              = "Height"
IDC_GUSBP_FRAME_BOLT                          = "Anchor Bolt"
IDC_GUSBP_LABEL_BOLT_DIAMETER                 = "Diameter"
IDC_GUSBP_LABEL_BOLT_LENGTH                   = "Length"
IDC_GUSBP_STRING_BOLT_LENGTH                  = "D"
IDC_GUSBP_LABEL_BOLT_POSITION                 = "Position"
IDC_GUSBP_LABEL_BOLT_POSITIONX                = "Position (x)"
IDC_GUSBP_LABEL_BOLT_POSITIONY                = "Position (y)"
IDC_GUSBP_LABEL_BOLT_NUMBER                   = "Number"
IDC_GUSBP_LABEL_BOLT_NUMBERX                  = "Number (x)"
IDC_GUSBP_LABEL_BOLT_NUMBERY                  = "Number (y)"
IDC_GUSBP_LABEL_BOLT_NUMBERXY                 = "Number (x | y)"
IDC_GUSBP_LABEL_PREVIEW                       = "Select item to display :"
IDC_GUSBP_LABEL_BASEPLATE_SHAPE               = "Shape"
IDC_GUSBP_LABEL_PEDESTAL_SHAPE                = "Shape"
IDC_GUSBP_LABEL_BOLT_ANGLE                    = "Start Angle"
IDC_GUSBP_LABEL_BOLT_INSTYPE                  = "Install Type"

//// IDD_STL_USBP_SECT_DLG
IDC_GUSBP_BTN_LCOMB                           = "Load Combinations ..."

///// IDD_STL_USBP_PLAT_DLG
IDC_GUSBP_RADIO_VIEW_PLAN                     = "Plan"
IDC_GUSBP_RADIO_VIEW_ELEV                     = "Elevation"

//IDD_STL_CRANEGIRDER_INPUT_DLG
IDC_GUSCG_FRAME_MATERIAL                      = "Material"
IDC_GUSCG_LABEL_MATERIAL                      = "Material"
IDC_GUSCG_FRAME_SECTION                       = "Section"
IDC_GUSCG_FRAME_PLATE                         = "Cover Plate"
IDC_GUSCG_LABEL_PLATE_THIC                    = "Thickness"
IDC_GUSCG_FRAME_GIRDER                        = "Girder"
IDC_GUSCG_LABEL_SPAN_SPAN                     = "Span"
IDC_GUSCG_LABEL_SPAN_RAIL                     = "Rail Width"
IDC_GUSCG_CHK_BACK_USE                        = "Back Truss"
IDC_GUSCG_LABEL_BACK_SPAN                     = "Span"
IDC_GUSCG_LABEL_BACK_DEPTH                    = "Depth"
IDC_GUSCG_CHK_BACK_TENSION                    = "Brace Tension Flange"
IDC_GUSCG_FRAME_VER_STIFF                     = "Vertical Stiffener"
IDC_GUSCG_LABEL_VER_STIFF_END_WIDTH           = "Width"
IDC_GUSCG_LABEL_VER_STIFF_END_SPACE           = "Spacing"
IDC_GUSCG_LABEL_VER_STIFF_END_THK1            = "Thickness"
IDC_GUSCG_LABEL_VER_STIFF_MID_WIDTH           = "Width"
IDC_GUSCG_LABEL_VER_STIFF_MID_SPACE           = "Spacing"
IDC_GUSCG_LABEL_VER_STIFF_MID_THK             = "Thickness"
IDC_GUSCG_STATIC_PICTURE                      = "Drawing"
IDC_GUSCG_FRAME_CRANE                         = "Crane Information ( Wheels )"
IDC_GUSCG_BTN_WHEEL_ADD                       = "Add"
IDC_GUSCG_BTN_WHEEL_DEL                       = "Delete"
IDC_GUSCG_BTN_WHEEL_INS                       = "Insert"
IDC_GUSCG_CHK_CRANE_SELF                      = "Consider Self Weight"
IDC_GUSCG_FRAME_FACTOR                        = "Impact Factor"
IDC_GUSCG_LABEL_FACTOR_VER                    = "Vertical"
IDC_GUSCG_LABEL_FACTOR_HOR                    = "Horizontal"
IDC_GUSCG_LABEL_FACTOR_RUN                    = "Runnig Dir."
IDC_GUSCG_FRAME_FATIGUE                       = "Fatigue"
IDC_GUCCB_LABEL_FATIGUE                       = "No. of Loading Cycles"
IDC_GUCCB_LABEL_DEFL2                         = "L /"
IDC_GUSCG_FRAME_DEFL                          = "Deflection"
IDC_GUCCB_LABEL_DEFL                          = "Criteria for Deflection"
IDC_GUSCG_CHK_VER_STIFF_END                   = "End Stiffener"
IDC_GUSCG_CHK_VER_STIFF_MID                   = "Mid Stiffener"
IDC_GUSCG_FRAME_PROPERTY                      = "Section Property"
IDC_GUSCG_FRAME_RESULT                        = "Calculation Result"
IDC_GUSCG_RDO_RESULT_CRANE                    = "Serviceability && Stiffener"
IDC_GUSCG_RDO_RESULT_BEAM                     = "Strength"
IDC_GUSCG_RDO_RESULT_FORCE                    = "Design Force"
IDC_GUSCG_LABEL_CRANE_TYPE                    = "Crane Type"
IDC_GUSCG_LABEL_CRANE_SPAN                    = "Crane Span"
IDC_GUSCG_STATIC_PICTURE_WHEEL                = "Drawing"
IDC_GUSCG_RDO_DRAW_SECT                       = "Section View"
IDC_GUSCG_RDO_DRAW_WHEEL                      = "Wheel View"
IDC_GUSCG_CHK_DEFL_HOR                        = "Check Horizontal Deflection"
IDC_GUCCB_LABEL_DEFL3                         = "L /"
IDC_GUCCB_LABEL_DEFLH                         = "Horizontal Criteria"

//IDD_STL_EMBPLATE_INPUT_DLG
IDC_GUSEP_FRAME_MATERIAL                      = "Material"
IDC_GUSEP_LABEL_MATERIAL_GIRDR                = "Beam / Girder"
IDC_GUSEP_LABEL_MATERIAL_PLATE                = "Embedded Plate"
IDC_GUSEP_LABEL_MATERIAL_RIB                  = "Rib Plate"
IDC_GUSEP_LABEL_MATERIAL_STUD                 = "Stud"
IDC_GUSEP_LABEL_MATERIAL_CONCRETE             = "Concrete"
IDC_GUSEP_LABEL_MATERIAL_REBAR                = "Rebar"
IDC_GUSEP_FRAME_TYPE                          = "Connection Type"
IDC_GUSEP_RDO_TYPE_SHEAR                      = "Shear Connection"
IDC_GUSEP_RDO_TYPE_MOMENT                     = "Moment Connection"
IDC_GUSEP_FRAME_FORCE                         = "Design Force"
IDC_GUSEP_CHK_PERCENT                         = "by Percent"
IDC_GUSEP_LABEL_FORCE_AXIAL                   = "Axial"
IDC_GUSEP_LABEL_FORCE_MOMENT_X                = "Moment (x)"
IDC_GUSEP_LABEL_FORCE_MOMENT_Y                = "Moment (y)"
IDC_GUSEP_LABEL_FORCE_SHEAR_X                 = "Shear (x)"
IDC_GUSEP_LABEL_FORCE_SHEAR_Y                 = "Shear (y)"
IDC_GUSEP_INPUT_BTN_LCOMB                     = "Load Combinations ..."
IDC_GUSEP_CHK_SOLVE_ALL                       = "Run FES for All Combination"
IDC_GUSEP_FRAME_EMBPLATE                      = "Embedded Plate"
IDC_GUSEP_LABEL_EMBPLATE_THICK                = "Thickness"
IDC_GUSEP_FRAME_SECTION                       = "Section"
IDC_GUSEP_FRAME_RCMEMB                        = "RC Member ( Wall / Column / Beam )"
IDC_GUSEP_CHK_RCMEMB_LEFT                     = "Left"
IDC_GUSEP_CHK_RCMEMB_RIGHT                    = "Right"
IDC_GUSEP_CHK_RCMEMB_TOP                      = "Top"
IDC_GUSEP_CHK_RCMEMB_BOT                      = "Bottom"
IDC_GUSEP_FRAME_STUD                          = "Headed Stud"
IDC_GUSEP_LABEL_STUD_TYPE                     = "Type"
IDC_GUSEP_LABEL_STUD_LENGTH                   = "Length"
IDC_GUSEP_LABEL_STUD_LENG_E1                  = "Ext. Length (X)"
IDC_GUSEP_LABEL_STUD_LENG_E2                  = "Ext. Length (Y)"
IDC_GUSEP_LABEL_STUD_SPACE_S1                 = "Space (Int.)"
IDC_GUSEP_LABEL_STUD_SPACE_S2                 = "Space (Ext. X)"
IDC_GUSEP_LABEL_STUD_SPACE_S3                 = "Space (Ext. Y)"
IDC_GUSEP_LABEL_STUD_NO_ROW                   = "No. of Row"
IDC_GUSEP_LABEL_STUD_NO_COL                   = "No. of Column"
IDC_GUSEP_CHK_REBAR_USE                       = "Rebar"
IDC_GUSEP_LABEL_REBAR_DIA                     = "Diameter"
IDC_GUSEP_LABEL_REBAR_SPACE                   = "Space"
IDC_GUSEP_LABEL_REBAR_NO_ROW                  = "No. of Row"
IDC_GUSEP_CHK_RIB_USE                         = "Rib Plate"
IDC_GUSEP_CHK_RIB_HOR                         = "Horizontal"
IDC_GUSEP_CHK_RIB_VER                         = "Vertical"
IDC_GUSEP_LABEL_RIB_DIST                      = "Dist. from Edge"
IDC_GUSEP_LABEL_RIB_HEIGHT                    = "Height"
IDC_GUSEP_LABEL_RIB_THICK                     = "Thickness"
IDC_GUSEP_LABEL_PREVIEW                       = "Select item to display :"
IDC_GUSEP_CHECK_PREVIEW_MESHLINE              = "Mesh Line"
IDC_GUSEP_CHECK_PREVIEW_CONTOUR               = "Contour"
IDC_GUSEP_CHECK_PREVIEW_VALUE                 = "Value"
IDC_GUSEP_FRAME_RESULT                        = "Calculation Result"
IDS_GUSEP_NOT_EXIST_BOLT_CONNECTION           = "There is no Bolt Connection Member."
IDS_GUSEP_NOT_EXIST_SHEAR_CONNECTION          = "There is no Shear Connection."
IDS_GUSEP_SELECT_MEMBER_TO_IMPORT             = "Select Member to Import Section Data."

IDS_URAB_RES_TN_CASE_STEEL                    = "Steel Strength"
IDS_URAB_RES_TN_CASE_BREAKOUT                 = "Concrete Breakout Strength"
IDS_URAB_RES_TN_CASE_PULLOUT                  = "Pullout Strength"
IDS_URAB_RES_TN_CASE_BLOWOUT                  = "Concrete Side-Face Blowout Strength"
IDS_URAB_RES_TN_CASE_BONDSTRS                 = "Bond Stress of Adhessive Anchor"

IDS_URAB_RES_VN_CASE_STEEL                    = "Steel Strength"
IDS_URAB_RES_VN_CASE_CONC                     = "Concrete Breakout Strength"
IDS_URAB_RES_VN_CASE_PRYOUT                   = "Concrete Pryout Strength"

/////// IDD_STL_EMBPLATE_SECT_IMPORT_DLG
IDD_STL_EMBPLATE_SECT_IMPORT_DLG              = "Import Section From Bolt Connection"

//IDD_STL_CRANEGIRDER_SMODE_INPUT_SECT3_DLG
IDC_GUSCG_LABEL_FATIGUE                       = "No. of Loading Cycles"
IDC_GUSCG_LABEL_DEFL2                         = "L /"
IDC_GUSCG_LABEL_DEFL                          = "Criteria for Defl."

//IDD_STL_EMBPLATE_SMODE_INPUT_SECT1_DLG
IDC_GUSEP_BTN_LCOMB                           = "Load Combinations ..."

//IDD_STL_EMBPLATE_SMODE_INPUT_SECT2_DLG
IDC_GUSEP_RADIO_VIEW_SECT                     = "Section"
IDC_GUSEP_RADIO_VIEW_ELEV                     = "Elevation"

//IDD_STL_EMBPLATE_SHEAR_PLATE_DLG
IDC_GUSEP_FRAME_SHEAR_PLATE                   = "Shear Plate"
IDC_GUSEP_LABEL_PLATE_GAP                     = "Gap"
IDC_GUSEP_LABEL_PLATE_THICK                   = "Thickness"
IDC_GUSEP_LABEL_PLATE_HEIGHT                  = "Height"
IDC_GUSEP_LABEL_PLATE_ECCEN                   = "Eccentricity (e)"
IDC_GUSEP_BTN_SECT_FROM_BC                    = "Get Section From Bolt Connection ..."

// IDD_STL_WELDING_SECT_ANGL_DLG
IDC_STL_WELD_SECT_FRM_WELD                    = "Weld Member"
IDC_STL_WELD_SECT_FRM_ANGL                    = "Angle Member"
IDC_STL_WELD_SECT_STC_SECT                    = "Section"
IDC_STL_WELD_SECT_STC_LENGTH                  = "Length"
IDC_STL_WELD_SECT_STC_NUM_ANG                 = "No. of Angle"
IDC_STL_WELD_SECT_STC_EA                      = "EA"
IDC_STL_WELD_SECT_FRM_BASE                    = "Base Member"
IDC_STL_WELD_SECT_STC_THICK                   = "Thickness"
IDC_STL_WELD_SECT_STC_GAP                     = "Gap"

// IDD_STL_WELDING_SECT_COLM_DLG
IDC_STL_WELD_SECT_CHK_STIF                    = "Use Stiffener"
IDC_STL_WELD_SECT_STC_WIDTH                   = "Width"

// IDD_STL_WELDING_INPUT_DLG
IDC_GUSWE_FRM_TYPE                            = "Connection Type"
IDC_GUSWE_RDO_CONN_TYPE1                      = "Direct Connection"
IDC_GUSWE_RDO_CONN_TYPE2                      = "Angle Connection"
IDC_GUSWE_RDO_CONN_TYPE3                      = "Column+Beam Connection"
IDC_GUSWE_FRM_MATL                            = "Material"
IDC_GUSWE_LBL_MATL_WELD                       = "Weld Member"
IDC_GUSWE_LBL_MATL_BASE                       = "Base Member"
IDC_GUSWE_LBL_MATL_ANGL                       = "Angle"
IDC_GUSWE_LBL_MATL_STIF                       = "Stiffener"
IDC_GUSWE_LBL_MATL_ELEC                       = "Electrode"
IDC_GUSWE_LBL_MATL_LRFD_ELEC                  = "Electrode (FExx)"
IDC_GUSWE_FRM_SECT                            = "Section"
IDC_GUSWE_FRM_FACT                            = "Factor"
IDC_GUSWE_LBL_MMT_DIST                        = "Moment Distribution Factor"
IDC_GUSWE_FRM_WELD                            = "Weld Size ( Leg Size )"
IDC_GUSWE_LBL_LEGS_FLG                        = "Flange"
IDC_GUSWE_LBL_LEGS_WEB                        = "Web"
IDC_GUSWE_FRM_POSI                            = "Welding Position"
IDC_GUSWE_BTN_WELD_POSI                       = "Select Position..."
IDC_GUSWE_FRM_FORC                            = "Force"
IDC_GUSWE_LBL_FORC_PU                         = "Px"
IDC_GUSWE_LBL_FORC_TU                         = "Tx"
IDC_GUSWE_LBL_FORC_MX                         = "Mx"
IDC_GUSWE_LBL_FORC_MY                         = "My"
IDC_GUSWE_LBL_FORC_VY                         = "Vy"
IDC_GUSWE_LBL_FORC_VX                         = "Vx"
IDC_GUSWE_LBL_FORC_LRFD_PU                    = "Pu"
IDC_GUSWE_LBL_FORC_LRFD_TU                    = "Tux"
IDC_GUSWE_LBL_FORC_LRFD_MX                    = "Mux"
IDC_GUSWE_LBL_FORC_LRFD_MY                    = "Muy"
IDC_GUSWE_LBL_FORC_LRFD_VY                    = "Vuy"
IDC_GUSWE_LBL_FORC_LRFD_VX                    = "Vux"
IDC_GUSWE_BTN_FORC_LCOM                       = "Load Combinations ..."
IDC_GUSWE_RDO_ANGL_WELD                       = "Weld Member Side"
IDC_GUSWE_RDO_ANGL_BASE                       = "Base Member Side"
IDC_GUSWE_FRM_RSLT                            = "Calculation Result"
IDC_GUSWE_FRM_PROP                            = "Section Property"
IDC_GUSWE_FRM_WELD_PROP                       = "Welding Property"

// IDD_STL_WELDING_LIST_DLG
IDC_GUSWE_LIST_STC_TYP                        = "Type :"
IDC_GUSWE_LIST_RDO_DIR                        = "Direct"
IDC_GUSWE_LIST_RDO_ANG                        = "Angle"
IDC_GUSWE_LIST_RDO_COL                        = "Column+Beam"

// IDD_STL_WELDING_SMODE_INPUT_SECT2_DLG
IDC_GUSWE_FRM_WELD_POSI                       = "Welding Position"

// IDD_STL_WELDING_POSITION_DLG
IDD_STL_WELDING_POSITION_DLG                  = "Welding Position"
IDC_STL_WELD_FRM_MEMB                         = "Select Member"
IDC_STL_WELD_BTN_ALL                          = "All"
IDC_STL_WELD_BTN_NON                          = "None"
IDC_STL_WELD_FRM_POSI                         = "Position"
IDC_STL_WELD_PICTURE                          = "13062"
IDC_STL_WELD_CHK_POS1                         = "1"
IDC_STL_WELD_CHK_POS2                         = "2"
IDC_STL_WELD_CHK_POS3                         = "3"
IDC_STL_WELD_CHK_POS4                         = "4"
IDC_STL_WELD_CHK_POS5                         = "5"
IDC_STL_WELD_CHK_POS6                         = "6"
IDC_STL_WELD_CHK_POS7                         = "7"
IDC_STL_WELD_CHK_POS8                         = "8"
/**/IDC_STL_WELD_CHK_LENGTH_POS1              = "1"
/**/IDC_STL_WELD_CHK_LENGTH_POS2              = "2"
/**/IDC_STL_WELD_CHK_LENGTH_POS3              = "3"
/**/IDC_STL_WELD_CHK_LENGTH_POS4              = "4"
/**/IDC_STL_WELD_CHK_LENGTH_POS5              = "5"
/**/IDC_STL_WELD_CHK_LENGTH_POS6              = "6"
/**/IDC_STL_WELD_CHK_LENGTH_POS7              = "7"
/**/IDC_STL_WELD_CHK_LENGTH_POS8              = "8"
/**/IDC_STL_WELD_FRM_LENGTH_NOTE              = "Note : All welds are located at the exact center of their respective components."
/**/IDC_STL_WELD_FRM_LENGTH_CAN_PROVIDE_TEXT  = "Maximum Length that can be Provided"
/**/IDC_STL_WELD_FRM_LENGTH_USER_PROVIDE_TEXT = "Provided Length"
/**/IDC_STL_WELD_FRM_LENG_POSI                = "Position"
/**/IDC_STL_WELD_FRM_USER_LENG                = "User-Defined Length of Weld"
IDC_STL_WELD_STATIC_INFO                      = "Info."
IDC_STL_WELD_BTN_OK                           = "OK"
IDC_STL_WELD_BTN_CANCEL                       = "Cancel"

// IDD_STL_CRANEGIRDER_LIST_WHEEL_DLG
IDD_STL_CRANEGIRDER_LIST_WHEEL_DLG            = "Crane Information"
IDC_STL_CRANEGIRDER_WHEEL_FRM_MEMB            = "Select Member"
IDC_STL_CRANEGIRDER_WHEEL_SELECT_BTN_ALL      = "All"
IDC_STL_CRANEGIRDER_WHEEL_SELECT_BTN_NONE     = "None"
IDC_STL_CRANEGIRDER_WHEEL_FRM_WHEEL           = "Wheels"
IDC_STL_CRANEGIRDER_WHEEL_BTN_ADD             = "Add"
IDC_STL_CRANEGIRDER_WHEEL_BTN_DEL             = "Delete"
IDC_STL_CRANEGIRDER_WHEEL_BTN_INS             = "Insert"
IDC_STL_CRANEGIRDER_WHEEL_BTN_APPLY           = "Apply"
IDC_STL_CRANEGIRDER_WHEEL_BTN_CANCEL          = "Cancel"

/////// IDD_STL_STAIR_INPUT_DLG
IDC_GUSST_FRAME_MATERIAL                      = "Material"
IDC_GUSST_LABEL_MATL_STRG                     = "Stringer"
IDC_GUSST_LABEL_MATL_PLATE                    = "Plate"
IDC_GUSST_FRAME_SUPPORT                       = "Support"
IDC_GUSST_LABEL_SUPPORT_TYPE                  = "Stair Type"
IDC_GUSST_LABEL_SUPPORT_LEFT                  = "Left"
IDC_GUSST_LABEL_SUPPORT_RIGHT                 = "Right"
IDC_GUSST_FRAME_SECT_STRG                     = "Stringer Section"
IDC_GUSST_LABEL_STRG_ST1                      = "Stringer1"
IDC_GUSST_LABEL_STRG_ST2                      = "Stringer2"
IDC_GUSST_LABEL_STRG_ST3                      = "Stringer3"
IDC_GUSST_LABEL_STRG_ST4                      = "Stringer4"
IDC_GUSST_CHECK_STRG_LB                       = "Consider Lb"
IDC_GUSST_FRAME_PLATE_STAIR                   = "Plate (Stair)"
IDC_GUSST_LABEL_PLATE_STAIR_THICK             = "Thickness"
IDC_GUSST_LABEL_PLATE_STAIR_HEIGHT1           = "Height (H1)"
IDC_GUSST_LABEL_PLATE_STAIR_HEIGHT2           = "Height (H2)"
IDC_GUSST_LABEL_PLATE_STAIR_WIDTH             = "Width (B1)"
IDC_GUSST_FRAME_PLATE_LAND                    = "Plate (Landing)"
IDC_GUSST_LABEL_PLATE_LAND_THICK              = "Thickness"
IDC_GUSST_FRAME_LENGTH                        = "Length"
IDC_GUSST_LABEL_LENGTH_LAND_L                 = "Landing(L)"
IDC_GUSST_LABEL_LENGTH_LAND_R                 = "Landing(R)"
IDC_GUSST_LABEL_LENGTH_STAIR                  = "Stair"
IDC_GUSST_FRAME_SIZE                          = "Size"
IDC_GUSST_LABEL_SIZE_HEIGHT                   = "Height"
IDC_GUSST_LABEL_SIZE_WIDTH                    = "Width"
IDC_GUSST_FRAME_LOAD_LAND                     = "Design Load (Landing)"
IDC_GUSST_LABEL_LOAD_LAND_DL                  = "Dead Load"
IDC_GUSST_LABEL_LOAD_LAND_LL                  = "Live Load"
IDC_GUSST_FRAME_LOAD_STRS                     = "Design Load (Stair)"
IDC_GUSST_LABEL_LOAD_STAIR_DL                 = "Dead Load"
IDC_GUSST_LABEL_LOAD_STAIR_LL                 = "Live Load"
IDC_GUSST_FRAME_PREVIEW                       = "Preview (Section && Diagram)"
IDC_GUSST_LABEL_PREVIEW_ITEM                  = "Item to Display :"
IDC_GUSST_FRAME_RESULT                        = "Calculation Result"

/////// IDD_STL_STAIR_SMODE_INPUT_SECT2_DLG
IDC_GUSST_FRAME_LOAD                          = "Design Load"
IDC_GUSST_FRAME_LOAD_STAIR                    = "Design Load (Stair)"

/////// IDD_STL_BOLTCONN_EC_INPUT_DLG
IDC_GUSBC_FRAME_SUPPORTING_BEAMCOLUMN         = "Supporting Member"
IDC_GUSBC_LABEL_MATERIAL_BEAMCOLUMN2          = "Supporting Member"
IDC_GUSBC_FRAME_SUPPORTING_BEAMCOLUMN2        = "Supporting Member"
IDC_GUSBC_LABEL_BOLT_NAME                     = "Name"
IDC_GUSBC_LABEL_BOLT_FLANGE_THICK             = "Thickness"
IDC_GUSBC_LABEL_FLG__PLATE                    = "Plate"
IDC_GUSBC_LABEL_MATERIAL_SUPPORTED_BEAM       = "Supported  Member"
IDC_GUSBC_FRAME_CONN_TYPE                     = "Connection Type"
IDC_GUSBC_LABEL_TYPE                          = "Type"
IDC_GUSBC_FRAME_SUPPORTED_BEAM                = "Supported Member"
IDC_GUSBC_FRAME_LEVEL_GAP                     = "Level / Gap"
IDC_GUSBC_LABEL_DIF_OF_LEVEL                  = "Difference of level"
IDC_GUSBC_LABEL_GAP                           = "Gap"
IDC_GUSBC_FRAME_WELDING                       = "Welding"
IDC_GUSBC_LABEL_WELDING_LEG                   = "Leg of Length"
IDC_GUSBC_LABEL_WELDING_MATERIAL              = "Material"
IDC_GUSBC_RADIO_BOLT_ORDINARY                 = "Ordinary"
IDC_GUSBC_RADIO_BOLT_COUNTERSUNK              = "Countersunk"
IDC_GUSBC_RADIO_FLG_INTERNAL                  = "Internal"
IDC_GUSBC_RADIO_FLG_EXTERNAL                  = "External"
IDC_GUSBC_FRAME_DIVI_PLATE                    = "Division Plate"
IDC_GUSBC_LABEL_BOLT_WEB_THICK2               = "Thickness"
IDC_GUSBC_CHK_DIVI_PLATE_APPLY                = "Apply Division Plate"
IDC_GUSBC_CHK_DIVI_PLATE_APPLY_ONLY           = "Apply"
IDC_GUSBC_FRAME_ENDPIN                        = "End / Fin Plate"
IDC_GUSBC_LABEL_BOLT_ENDPIN_NO                = "No. of Bolt"
IDC_GUSBC_LABEL_BOLT_ENDPIN_THICK             = "Thickness"
IDC_GUSBC_LABEL_ENDFIN_DEPTH                  = "Depth"
IDC_GUSBC_RADIO_ENDPIN_DEPTH_FULL             = "Full"
IDC_GUSBC_RADIO_ENDPIN_DEPTH_PARTIAL          = "Partial"
IDC_GUSBC_RADIO_POSITION_FLANGE               = "Flange"
IDC_GUSBC_RADIO_POSITION_WEB                  = "Web"
IDC_GUSBC_LABEL_SUPPORTING_POSITION           = "Position"

/////// IDD_STL_FORCE_INPUT_COL_BEARING_DLG
IDC_GUSBC_LABEL_FORCE_PERMA_AXIAL             = "Permanent Axial"

/////// IDD_STL_FORCE_INPUT_FINEND_DLG
IDC_GUSBC_LABEL_FORCE_VY2                     = "Shear ( y2 )"
IDC_GUSBC_LABEL_FORCE_HP2                     = "Depth ( hp2 )"
IDC_GUSBC_LABEL_FORCE_N3                      = "N3"
IDC_GUSBC_RADIO_FORCE_NO_BEAM_1               = "1"
IDC_GUSBC_RADIO_FORCE_NO_BEAM_2               = "2"
IDC_GUSBC_LABEL_NO_SUPPORTED_BEAM             = "No. of supported beam"

/////// IDD_STL_BOLT_HOLE_DLG
IDD_STL_BOLT_HOLE_DLG                         = "Bolt Hole Information"
IDC_STL_BOLT_HOLE_FRM_MEMB                    = "Select Member"
IDC_STL_BOLT_HOLE_FRM_HOLE                    = "Bolt Hole"
IDC_STL_BOLT_HOLE_LBL_HOLE                    = "Hole Type"
IDC_STL_BOLT_HOLE_LBL_TYPE                    = "Size Type"
IDC_STL_BOLT_HOLE_LBL_SIZE                    = "Diameter"
IDC_STL_BOLT_HOLE_LBL_LENG                    = "Length"
IDC_STL_BOLT_HOLE_CHK_HFLG                    = "Horizontal Hole for Flange"
IDC_STL_BOLT_HOLE_CHK_HWEB                    = "Horizontal Hole for Web"
IDS_STL_BOLT_HOLE_TOOLTIP_LENG                = "Distance between Center to Center of Bolt Hole"

/////// IDD_STL_TOOL_UNBR_LENG_DLG
IDD_STL_TOOL_UNBR_LENG_DLG                    = "Unbraced Length"
IDD_STL_TOOL_BRACE_STR_DLG                    = "Brace Strength"
IDD_STL_TOOL_LINK_STIF_DLG                    = "Link Stiffener"
IDD_STL_TOOL_BEAM_VBRA_DLG                    = "Beam Strength with V Brace"
IDS_STL_TOOL_MSG_GET_FROM_STEEL_OPTION        = "Do you want to get section from Steel Option?"
IDS_STL_TOOL_MSG_STEEL_OPTION_IS_EMPTY        = "There is no Section(s) in Steel Option?"
IDS_STL_TOOL_MSG_CALC_BRACE_STRENGTH          = "Calculating Brace Strength ..."
IDS_STL_TOOL_MSG_CALC_BEAM_STRENGTH           = "Calculating Beam Strength with V Brace ..."
IDS_STL_TOOL_BTN_CALCULATE                    = "Calculate"
IDS_STL_TOOL_HIDE_SECTION_SIZE_COLUMN         = "Hide Size Column"
IDS_STL_TOOL_SHOW_PREVIEW                     = "Show Preview"
IDS_STL_TOOL_CHK_MSG_INVALID_SECT             = "Invalid Section"
IDS_STL_TOOL_CHK_MSG_INVALID_MATL             = "Invalid Material"
IDS_STL_TOOL_MSG_SELECT_CELL_TO_INSERT        = "Select Cell to insert Data."
IDS_STL_TOOL_MSG_SELECT_CELL_VALID            = "Select Valid Cell(s)."
IDS_STL_TOOL_CHK_MEMB_TYPE_BEAM               = "Beam"
IDS_STL_TOOL_CHK_MEMB_TYPE_BRACE              = "Brace"
IDS_STL_TOOL_CHK_MEMB_TYPE_BRA1               = "Brace1"
IDS_STL_TOOL_CHK_MEMB_TYPE_BRA2               = "Brace2"
IDS_STL_TOOL_CHECK_RESULT_OF_BRACE            = "Check Result of Brace"
IDS_STL_TOOL_CHECK_RESULT_OF_BEAM             = "Check Result of Beam"
IDS_STL_TOOL_DESIGN_FORCES                    = "Design Forces"
IDS_STL_TOOL_DESIGN_STRENGTH                  = "Design Strength"
IDS_STL_TOOL_STRENGTH_RATIO                   = "Strength Ratio"

/////// MOMENT BOLT CONNECTION ( END-PLATE TYPE )
IDS_STL_CHK_STIFF_APPLY                       = "Use Stiffener"
IDS_STL_CHK_STIFF_TOP_APPLY                   = "Use Top Stiffener"
IDS_STL_CHK_STIFF_BOT_APPLY                   = "Use Bottom Stiffener"
IDS_STL_CHK_FULL_DEPTH                        = "Full Depth"
IDS_STL_LBL_EDGE_LENGTH                       = "Edge Length"
IDS_STL_LBL_EDGE_HEIGHT                       = "Edge Height"
IDS_STL_LBL_BOLT_NAME                         = "Bolt Name"
IDS_STL_LBL_INT_DOT                           = "Int."
IDS_STL_LBL_EXT_DOT                           = "Ext."
IDS_STL_LBL_CONSIDER_WEB_THICKNESS            = "Consider Web Thickness"
IDS_STL_LBL_CONSIDER_FLG_THICKNESS            = "Consider Flange Thickness"
IDS_STL_LBL_ROWCOL_COLS                       = "Columns"
IDS_STL_LBL_ROWCOL_ROWS                       = "Rows"
IDS_STL_CHK_APPLY_EXPECTED_YIELD_STRESS       = "Apply Expected Yield Stress"
IDS_STL_FRM_DESIGN_PARAMETER                  = "Design Parameter"
IDS_STL_LBL_EXTENSION_ABB                     = "Ext."
